Maihuanyi/rt-thread/bsp/mm32f526x/Libraries/MM32F526x/Include/reg_flexcan.h
/**
  * @brief FLEXCAN_IMASK1 Register Bit Definition
  */
#define  FLEXCAN_IMASK1_BUF31TO0M_Pos             (0)
#define  FLEXCAN_IMASK1_BUF31TO0M_Msk             (0xFFFFFFFFU << FLEXCAN_IMASK1_BUF31TO0M_Pos)     /*!<MBi Mask Bits ！ Each bit enables or disables the corresponding interrupt for MB15 to MB0*/
#define  FLEXCAN_IMASK1_BUF31TO0M                 FLEXCAN_IMASK1_BUF31TO0M_Msk
#define  FLEXCAN_IMASK1_BUF31TO0M_0               (0x00000001U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_1               (0x00000002U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_2               (0x00000004U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_3               (0x00000008U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_4               (0x00000010U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_5               (0x00000020U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_6               (0x00000040U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_7               (0x00000080U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_8               (0x00000100U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_9               (0x00000200U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_10              (0x00000400U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_11              (0x00000800U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_12              (0x00001000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_13              (0x00002000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_14              (0x00004000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_15              (0x00008000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_16              (0x00010000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_17              (0x00020000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_18              (0x00040000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_19              (0x00080000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_20              (0x00100000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_21              (0x00200000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_22              (0x00400000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_23              (0x00800000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_24              (0x01000000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_25              (0x02000000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_26              (0x04000000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_27              (0x08000000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_28              (0x10000000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_29              (0x20000000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_30              (0x40000000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 
#define  FLEXCAN_IMASK1_BUF31TO0M_31              (0x80000000U << FLEXCAN_IMASK1_BUF31TO0M_Pos) 

/**
  * @brief FLEXCAN_IFLAG1 Register Bit Definition
  */
#define  FLEXCAN_IFLAG1_BUF0I_Pos                 (0)
#define  FLEXCAN_IFLAG1_BUF0I_Msk                 (0x1U << FLEXCAN_IFLAG1_BUF0I_Pos)                /*!<MB0 Interrupt or Clear FIFO bit*/
#define  FLEXCAN_IFLAG1_BUF0I                     FLEXCAN_IFLAG1_BUF0I_Msk
#define  FLEXCAN_IFLAG1_BUF4TO1I_Pos              (1)
#define  FLEXCAN_IFLAG1_BUF4TO1I_Msk              (0xFU << FLEXCAN_IFLAG1_BUF4TO1I_Pos)             /*!<MB4~1 Interrupt or Reserved*/
#define  FLEXCAN_IFLAG1_BUF4TO1I                  FLEXCAN_IFLAG1_BUF4TO1I_Msk
#define  FLEXCAN_IFLAG1_BUF4TO1I_0                (0x1U << FLEXCAN_IFLAG1_BUF4TO1I_Pos) 
#define  FLEXCAN_IFLAG1_BUF4TO1I_1                (0x2U << FLEXCAN_IFLAG1_BUF4TO1I_Pos) 
#define  FLEXCAN_IFLAG1_BUF4TO1I_2                (0x4U << FLEXCAN_IFLAG1_BUF4TO1I_Pos) 
#define  FLEXCAN_IFLAG1_BUF4TO1I_3                (0x8U << FLEXCAN_IFLAG1_BUF4TO1I_Pos) 
#define  FLEXCAN_IFLAG1_BUF5I_Pos                 (5)
#define  FLEXCAN_IFLAG1_BUF5I_Msk                 (0x1U << FLEXCAN_IFLAG1_BUF5I_Pos)                /*!<MB5 Interrupt or Frames Available in Rx FIFO*/
#define  FLEXCAN_IFLAG1_BUF5I                     FLEXCAN_IFLAG1_BUF5I_Msk
#define  FLEXCAN_IFLAG1_BUF6I_Pos                 (6)
#define  FLEXCAN_IFLAG1_BUF6I_Msk                 (0x1U << FLEXCAN_IFLAG1_BUF6I_Pos)                /*!<MB6 Interrupt or Rx FIFO Warning*/
#define  FLEXCAN_IFLAG1_BUF6I                     FLEXCAN_IFLAG1_BUF6I_Msk
#define  FLEXCAN_IFLAG1_BUF7I_Pos                 (7)
#define  FLEXCAN_IFLAG1_BUF7I_Msk                 (0x1U << FLEXCAN_IFLAG1_BUF7I_Pos)                /*!<MB7 Interrupt or Rx FIFO Overflow*/
#define  FLEXCAN_IFLAG1_BUF7I                     FLEXCAN_IFLAG1_BUF7I_Msk
#define  FLEXCAN_IFLAG1_BUF31TO8I_Pos             (8)
#define  FLEXCAN_IFLAG1_BUF31TO8I_Msk             (0xFFFFFFU << FLEXCAN_IFLAG1_BUF31TO8I_Pos)       /*!<MBi Interrupt Flag Bits ！ Each bit flags the corresponding Message Buffer Interrupt for MB15 to MB8*/
#define  FLEXCAN_IFLAG1_BUF31TO8I                 FLEXCAN_IFLAG1_BUF31TO8I_Msk
#define  FLEXCAN_IFLAG1_BUF31TO8I_0               (0x000001U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_1               (0x000002U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_2               (0x000004U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_3               (0x000008U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_4               (0x000010U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_5               (0x000020U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_6               (0x000040U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_7               (0x000080U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_8               (0x000100U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_9               (0x000200U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_10              (0x000400U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_11              (0x000800U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_12              (0x001000U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_13              (0x002000U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_14              (0x004000U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_15              (0x008000U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_16              (0x010000U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_17              (0x020000U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_18              (0x040000U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_19              (0x080000U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_20              (0x100000U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_21              (0x200000U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_22              (0x400000U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 
#define  FLEXCAN_IFLAG1_BUF31TO8I_23              (0x800000U << FLEXCAN_IFLAG1_BUF31TO8I_Pos) 

/**
  * @brief FLEXCAN_CTRL2 Register Bit Definition
  */
#define  FLEXCAN_CTRL2_EDFLTDIS_Pos               (11)
#define  FLEXCAN_CTRL2_EDFLTDIS_Msk               (0x1U << FLEXCAN_CTRL2_EDFLTDIS_Pos)              /*!<During the bus integration state*/
#define  FLEXCAN_CTRL2_EDFLTDIS                   FLEXCAN_CTRL2_EDFLTDIS_Msk
#define  FLEXCAN_CTRL2_ISOCANFDEN_Pos             (12)
#define  FLEXCAN_CTRL2_ISOCANFDEN_Msk             (0x1U << FLEXCAN_CTRL2_ISOCANFDEN_Pos)            /*!<1: ISO CAN FD enable (ISO 11898 protocol standard)*/
#define  FLEXCAN_CTRL2_ISOCANFDEN                 FLEXCAN_CTRL2_ISOCANFDEN_Msk
#define  FLEXCAN_CTRL2_PREXCEN_Pos                (14)
#define  FLEXCAN_CTRL2_PREXCEN_Msk                (0x1U << FLEXCAN_CTRL2_PREXCEN_Pos)               /*!<*/
#define  FLEXCAN_CTRL2_PREXCEN                    FLEXCAN_CTRL2_PREXCEN_Msk
#define  FLEXCAN_CTRL2_EACEN_Pos                  (16)
#define  FLEXCAN_CTRL2_EACEN_Msk                  (0x1U << FLEXCAN_CTRL2_EACEN_Pos)                 /*!<Entire Frame Arbitration Field Comparison Enable For Rx Mailboxes*/
#define  FLEXCAN_CTRL2_EACEN                      FLEXCAN_CTRL2_EACEN_Msk
#define  FLEXCAN_CTRL2_RRS_Pos                    (17)
#define  FLEXCAN_CTRL2_RRS_Msk                    (0x1U << FLEXCAN_CTRL2_RRS_Pos)                   /*!<Remote Request Storing*/
#define  FLEXCAN_CTRL2_RRS                        FLEXCAN_CTRL2_RRS_Msk
#define  FLEXCAN_CTRL2_MRP_Pos                    (18)
#define  FLEXCAN_CTRL2_MRP_Msk                    (0x1U << FLEXCAN_CTRL2_MRP_Pos)                   /*!<Mailboxes Reception Priority*/
#define  FLEXCAN_CTRL2_MRP                        FLEXCAN_CTRL2_MRP_Msk
#define  FLEXCAN_CTRL2_TASD_Pos                   (19)
#define  FLEXCAN_CTRL2_TASD_Msk                   (0x1FU << FLEXCAN_CTRL2_TASD_Pos)                 /*!<Tx Arbitration Start Delay ！ Indicates how many CAN bits the Tx arbitration process start point can be delayed from the first bit of CRC field on CAN bus. See ＾23.3.10.6 Tx Arbitration start delay￣.*/
#define  FLEXCAN_CTRL2_TASD                       FLEXCAN_CTRL2_TASD_Msk
#define  FLEXCAN_CTRL2_TASD_0                     (0x01U << FLEXCAN_CTRL2_TASD_Pos) 
#define  FLEXCAN_CTRL2_TASD_1                     (0x02U << FLEXCAN_CTRL2_TASD_Pos) 
#define  FLEXCAN_CTRL2_TASD_2                     (0x04U << FLEXCAN_CTRL2_TASD_Pos) 
#define  FLEXCAN_CTRL2_TASD_3                     (0x08U << FLEXCAN_CTRL2_TASD_Pos) 
#define  FLEXCAN_CTRL2_TASD_4                     (0x10U << FLEXCAN_CTRL2_TASD_Pos) 
#define  FLEXCAN_CTRL2_RFFN_Pos                   (24)
#define  FLEXCAN_CTRL2_RFFN_Msk                   (0xFU << FLEXCAN_CTRL2_RFFN_Pos)                  /*!<The number of Rx FIFO filters, as shown in Table 23-12 RFFN must not be programmed with values that make the number of MBs occupied by Rx FIFO and ID Filter exceed the number of mailboxes defined by CAN_MCR.MAXMB.*/
#define  FLEXCAN_CTRL2_RFFN                       FLEXCAN_CTRL2_RFFN_Msk
#define  FLEXCAN_CTRL2_RFFN_0                     (0x1U << FLEXCAN_CTRL2_RFFN_Pos) 
#define  FLEXCAN_CTRL2_RFFN_1                     (0x2U << FLEXCAN_CTRL2_RFFN_Pos) 
#define  FLEXCAN_CTRL2_RFFN_2                     (0x4U << FLEXCAN_CTRL2_RFFN_Pos) 
#define  FLEXCAN_CTRL2_RFFN_3                     (0x8U << FLEXCAN_CTRL2_RFFN_Pos) 
#define  FLEXCAN_CTRL2_BOFFDONEMSK_Pos            (30)
#define  FLEXCAN_CTRL2_BOFFDONEMSK_Msk            (0x1U << FLEXCAN_CTRL2_BOFFDONEMSK_Pos)           /*!<Bus Off Done Interrupt (CAN_ESR1.BOFFDONEINT) Mask*/
#define  FLEXCAN_CTRL2_BOFFDONEMSK                FLEXCAN_CTRL2_BOFFDONEMSK_Msk
#define  FLEXCAN_CTRL2_ERRMSKFAST_Pos             (31)
#define  FLEXCAN_CTRL2_ERRMSKFAST_Msk             (0x1U << FLEXCAN_CTRL2_ERRMSKFAST_Pos)            /*!<Reserved, must be kept at reset value*/
#define  FLEXCAN_CTRL2_ERRMSKFAST                 FLEXCAN_CTRL2_ERRMSKFAST_Msk

/**
  * @brief FLEXCAN_ESR2 Register Bit Definition
  */
#define  FLEXCAN_ESR2_IMB_Pos                     (13)
#define  FLEXCAN_ESR2_IMB_Msk                     (0x1U << FLEXCAN_ESR2_IMB_Pos)                    /*!<Inactive Mailbox*/
#define  FLEXCAN_ESR2_IMB                         FLEXCAN_ESR2_IMB_Msk
#define  FLEXCAN_ESR2_VPS_Pos                     (14)
#define  FLEXCAN_ESR2_VPS_Msk                     (0x1U << FLEXCAN_ESR2_VPS_Pos)                    /*!<Indicates whether CAN_ESR2.IMB and CAN_ESR2.LPTM contents are currently valid or not*/
#define  FLEXCAN_ESR2_VPS                         FLEXCAN_ESR2_VPS_Msk
#define  FLEXCAN_ESR2_LPTM_Pos                    (16)
#define  FLEXCAN_ESR2_LPTM_Msk                    (0x7FU << FLEXCAN_ESR2_LPTM_Pos)                  /*!<Lowest Priority Tx Mailbox*/
#define  FLEXCAN_ESR2_LPTM                        FLEXCAN_ESR2_LPTM_Msk
#define  FLEXCAN_ESR2_LPTM_0                      (0x01U << FLEXCAN_ESR2_LPTM_Pos) 
#define  FLEXCAN_ESR2_LPTM_1                      (0x02U << FLEXCAN_ESR2_LPTM_Pos) 
#define  FLEXCAN_ESR2_LPTM_2                      (0x04U << FLEXCAN_ESR2_LPTM_Pos) 
#define  FLEXCAN_ESR2_LPTM_3                      (0x08U << FLEXCAN_ESR2_LPTM_Pos) 
#define  FLEXCAN_ESR2_LPTM_4                      (0x10U << FLEXCAN_ESR2_LPTM_Pos) 
#define  FLEXCAN_ESR2_LPTM_5                      (0x20U << FLEXCAN_ESR2_LPTM_Pos) 
#define  FLEXCAN_ESR2_LPTM_6                      (0x40U << FLEXCAN_ESR2_LPTM_Pos) 

/**
  * @brief FLEXCAN_CRCR Register Bit Definition
  */
#define  FLEXCAN_CRCR_TXCRC_Pos                   (0)
#define  FLEXCAN_CRCR_TXCRC_Msk                   (0x7FFFU << FLEXCAN_CRCR_TXCRC_Pos)               /*!<Transmitted CRC Value ！ Indicates the CRC value of the last transmitted message*/
#define  FLEXCAN_CRCR_TXCRC                       FLEXCAN_CRCR_TXCRC_Msk
#define  FLEXCAN_CRCR_TXCRC_0                     (0x0001U << FLEXCAN_CRCR_TXCRC_Pos) 
#define  FLEXCAN_CRCR_TXCRC_1                     (0x0002U << FLEXCAN_CRCR_TXCRC_Pos) 
#define  FLEXCAN_CRCR_TXCRC_2                     (0x0004U << FLEXCAN_CRCR_TXCRC_Pos) 
#define  FLEXCAN_CRCR_TXCRC_3                     (0x0008U << FLEXCAN_CRCR_TXCRC_Pos) 
#define  FLEXCAN_CRCR_TXCRC_4                     (0x0010U << FLEXCAN_CRCR_TXCRC_Pos) 
#define  FLEXCAN_CRCR_TXCRC_5                     (0x0020U << FLEXCAN_CRCR_TXCRC_Pos) 
#define  FLEXCAN_CRCR_TXCRC_6                     (0x0040U << FLEXCAN_CRCR_TXCRC_Pos) 
#define  FLEXCAN_CRCR_TXCRC_7                     (0x0080U << FLEXCAN_CRCR_TXCRC_Pos) 
#define  FLEXCAN_CRCR_TXCRC_8                     (0x0100U << FLEXCAN_CRCR_TXCRC_Pos) 
#define  FLEXCAN_CRCR_TXCRC_9                     (0x0200U << FLEXCAN_CRCR_TXCRC_Pos) 
#define  FLEXCAN_CRCR_TXCRC_10                    (0x0400U << FLEXCAN_CRCR_TXCRC_Pos) 
#define  FLEXCAN_CRCR_TXCRC_11                    (0x0800U << FLEXCAN_CRCR_TXCRC_Pos) 
#define  FLEXCAN_CRCR_TXCRC_12                    (0x1000U << FLEXCAN_CRCR_TXCRC_Pos) 
#define  FLEXCAN_CRCR_TXCRC_13                    (0x2000U << FLEXCAN_CRCR_TXCRC_Pos) 
#define  FLEXCAN_CRCR_TXCRC_14                    (0x4000U << FLEXCAN_CRCR_TXCRC_Pos) 
#define  FLEXCAN_CRCR_MBCRC_Pos                   (16)
#define  FLEXCAN_CRCR_MBCRC_Msk                   (0x7FU << FLEXCAN_CRCR_MBCRC_Pos)                 /*!<CRC Mailbox ！ Indicates the number of the mailbox corresponding to the value in the CAN_CRCR.TXCRC field*/
#define  FLEXCAN_CRCR_MBCRC                       FLEXCAN_CRCR_MBCRC_Msk
#define  FLEXCAN_CRCR_MBCRC_0                     (0x01U << FLEXCAN_CRCR_MBCRC_Pos) 
#define  FLEXCAN_CRCR_MBCRC_1                     (0x02U << FLEXCAN_CRCR_MBCRC_Pos) 
#define  FLEXCAN_CRCR_MBCRC_2                     (0x04U << FLEXCAN_CRCR_MBCRC_Pos) 
#define  FLEXCAN_CRCR_MBCRC_3                     (0x08U << FLEXCAN_CRCR_MBCRC_Pos) 
#define  FLEXCAN_CRCR_MBCRC_4                     (0x10U << FLEXCAN_CRCR_MBCRC_Pos) 
#define  FLEXCAN_CRCR_MBCRC_5                     (0x20U << FLEXCAN_CRCR_MBCRC_Pos) 
#define  FLEXCAN_CRCR_MBCRC_6                     (0x40U << FLEXCAN_CRCR_MBCRC_Pos) 

/**
  * @brief FLEXCAN_RXFGMASK Register Bit Definition
  */
#define  FLEXCAN_RXFGMASK_FGM_Pos                 (0)
#define  FLEXCAN_RXFGMASK_FGM_Msk                 (0xFFFFFFFFU << FLEXCAN_RXFGMASK_FGM_Pos)         /*!<Rx FIFO Global Mask Bits ！ Mask the ID Filter Table elements bits*/
#define  FLEXCAN_RXFGMASK_FGM                     FLEXCAN_RXFGMASK_FGM_Msk
#define  FLEXCAN_RXFGMASK_FGM_0                   (0x00000001U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_1                   (0x00000002U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_2                   (0x00000004U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_3                   (0x00000008U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_4                   (0x00000010U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_5                   (0x00000020U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_6                   (0x00000040U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_7                   (0x00000080U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_8                   (0x00000100U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_9                   (0x00000200U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_10                  (0x00000400U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_11                  (0x00000800U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_12                  (0x00001000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_13                  (0x00002000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_14                  (0x00004000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_15                  (0x00008000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_16                  (0x00010000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_17                  (0x00020000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_18                  (0x00040000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_19                  (0x00080000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_20                  (0x00100000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_21                  (0x00200000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_22                  (0x00400000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_23                  (0x00800000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_24                  (0x01000000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_25                  (0x02000000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_26                  (0x04000000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_27                  (0x08000000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_28                  (0x10000000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_29                  (0x20000000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_30                  (0x40000000U << FLEXCAN_RXFGMASK_FGM_Pos) 
#define  FLEXCAN_RXFGMASK_FGM_31                  (0x80000000U << FLEXCAN_RXFGMASK_FGM_Pos) 

/**
  * @brief FLEXCAN_RXFIR Register Bit Definition
  */
#define  FLEXCAN_RXFIR_IDHIT_Pos                  (0)
#define  FLEXCAN_RXFIR_IDHIT_Msk                  (0x1FFU << FLEXCAN_RXFIR_IDHIT_Pos)               /*!<ID Acceptance Filter Hit Indicator ！ Indicates which ID Acceptance Filter (IDAF) was hit by the received message in the Rx FIFO*/
#define  FLEXCAN_RXFIR_IDHIT                      FLEXCAN_RXFIR_IDHIT_Msk
#define  FLEXCAN_RXFIR_IDHIT_0                    (0x001U << FLEXCAN_RXFIR_IDHIT_Pos) 
#define  FLEXCAN_RXFIR_IDHIT_1                    (0x002U << FLEXCAN_RXFIR_IDHIT_Pos) 
#define  FLEXCAN_RXFIR_IDHIT_2                    (0x004U << FLEXCAN_RXFIR_IDHIT_Pos) 
#define  FLEXCAN_RXFIR_IDHIT_3                    (0x008U << FLEXCAN_RXFIR_IDHIT_Pos) 
#define  FLEXCAN_RXFIR_IDHIT_4                    (0x010U << FLEXCAN_RXFIR_IDHIT_Pos) 
#define  FLEXCAN_RXFIR_IDHIT_5                    (0x020U << FLEXCAN_RXFIR_IDHIT_Pos) 
#define  FLEXCAN_RXFIR_IDHIT_6                    (0x040U << FLEXCAN_RXFIR_IDHIT_Pos) 
#define  FLEXCAN_RXFIR_IDHIT_7                    (0x080U << FLEXCAN_RXFIR_IDHIT_Pos) 
#define  FLEXCAN_RXFIR_IDHIT_8                    (0x100U << FLEXCAN_RXFIR_IDHIT_Pos) 

