Maihuanyi/rt-thread/bsp/mm32f526x/Libraries/MM32F526x/Include/reg_flexcan.h
/**
  * @brief FLEXCAN_CBT Register Bit Definition
  */
#define  FLEXCAN_CBT_EPSEG2_Pos                   (0)
#define  FLEXCAN_CBT_EPSEG2_Msk                   (0x1FU << FLEXCAN_CBT_EPSEG2_Pos)                 /*!<Extended Phase Segment 2*/
#define  FLEXCAN_CBT_EPSEG2                       FLEXCAN_CBT_EPSEG2_Msk
#define  FLEXCAN_CBT_EPSEG2_0                     (0x01U << FLEXCAN_CBT_EPSEG2_Pos) 
#define  FLEXCAN_CBT_EPSEG2_1                     (0x02U << FLEXCAN_CBT_EPSEG2_Pos) 
#define  FLEXCAN_CBT_EPSEG2_2                     (0x04U << FLEXCAN_CBT_EPSEG2_Pos) 
#define  FLEXCAN_CBT_EPSEG2_3                     (0x08U << FLEXCAN_CBT_EPSEG2_Pos) 
#define  FLEXCAN_CBT_EPSEG2_4                     (0x10U << FLEXCAN_CBT_EPSEG2_Pos) 
#define  FLEXCAN_CBT_EPSEG1_Pos                   (5)
#define  FLEXCAN_CBT_EPSEG1_Msk                   (0x1FU << FLEXCAN_CBT_EPSEG1_Pos)                 /*!<Extended Phase Segment 1*/
#define  FLEXCAN_CBT_EPSEG1                       FLEXCAN_CBT_EPSEG1_Msk
#define  FLEXCAN_CBT_EPSEG1_0                     (0x01U << FLEXCAN_CBT_EPSEG1_Pos) 
#define  FLEXCAN_CBT_EPSEG1_1                     (0x02U << FLEXCAN_CBT_EPSEG1_Pos) 
#define  FLEXCAN_CBT_EPSEG1_2                     (0x04U << FLEXCAN_CBT_EPSEG1_Pos) 
#define  FLEXCAN_CBT_EPSEG1_3                     (0x08U << FLEXCAN_CBT_EPSEG1_Pos) 
#define  FLEXCAN_CBT_EPSEG1_4                     (0x10U << FLEXCAN_CBT_EPSEG1_Pos) 
#define  FLEXCAN_CBT_EPROPSEG_Pos                 (10)
#define  FLEXCAN_CBT_EPROPSEG_Msk                 (0x3FU << FLEXCAN_CBT_EPROPSEG_Pos)               /*!<Extended Propagation Segment*/
#define  FLEXCAN_CBT_EPROPSEG                     FLEXCAN_CBT_EPROPSEG_Msk
#define  FLEXCAN_CBT_EPROPSEG_0                   (0x01U << FLEXCAN_CBT_EPROPSEG_Pos) 
#define  FLEXCAN_CBT_EPROPSEG_1                   (0x02U << FLEXCAN_CBT_EPROPSEG_Pos) 
#define  FLEXCAN_CBT_EPROPSEG_2                   (0x04U << FLEXCAN_CBT_EPROPSEG_Pos) 
#define  FLEXCAN_CBT_EPROPSEG_3                   (0x08U << FLEXCAN_CBT_EPROPSEG_Pos) 
#define  FLEXCAN_CBT_EPROPSEG_4                   (0x10U << FLEXCAN_CBT_EPROPSEG_Pos) 
#define  FLEXCAN_CBT_EPROPSEG_5                   (0x20U << FLEXCAN_CBT_EPROPSEG_Pos) 
#define  FLEXCAN_CBT_ERJW_Pos                     (16)
#define  FLEXCAN_CBT_ERJW_Msk                     (0x1FU << FLEXCAN_CBT_ERJW_Pos)                   /*!<Extended Resync Jump Width*/
#define  FLEXCAN_CBT_ERJW                         FLEXCAN_CBT_ERJW_Msk
#define  FLEXCAN_CBT_ERJW_0                       (0x01U << FLEXCAN_CBT_ERJW_Pos) 
#define  FLEXCAN_CBT_ERJW_1                       (0x02U << FLEXCAN_CBT_ERJW_Pos) 
#define  FLEXCAN_CBT_ERJW_2                       (0x04U << FLEXCAN_CBT_ERJW_Pos) 
#define  FLEXCAN_CBT_ERJW_3                       (0x08U << FLEXCAN_CBT_ERJW_Pos) 
#define  FLEXCAN_CBT_ERJW_4                       (0x10U << FLEXCAN_CBT_ERJW_Pos) 
#define  FLEXCAN_CBT_EPRESDIV_Pos                 (21)
#define  FLEXCAN_CBT_EPRESDIV_Msk                 (0x3FFU << FLEXCAN_CBT_EPRESDIV_Pos)              /*!<Extended Prescaler Division Factor*/
#define  FLEXCAN_CBT_EPRESDIV                     FLEXCAN_CBT_EPRESDIV_Msk
#define  FLEXCAN_CBT_EPRESDIV_0                   (0x001U << FLEXCAN_CBT_EPRESDIV_Pos) 
#define  FLEXCAN_CBT_EPRESDIV_1                   (0x002U << FLEXCAN_CBT_EPRESDIV_Pos) 
#define  FLEXCAN_CBT_EPRESDIV_2                   (0x004U << FLEXCAN_CBT_EPRESDIV_Pos) 
#define  FLEXCAN_CBT_EPRESDIV_3                   (0x008U << FLEXCAN_CBT_EPRESDIV_Pos) 
#define  FLEXCAN_CBT_EPRESDIV_4                   (0x010U << FLEXCAN_CBT_EPRESDIV_Pos) 
#define  FLEXCAN_CBT_EPRESDIV_5                   (0x020U << FLEXCAN_CBT_EPRESDIV_Pos) 
#define  FLEXCAN_CBT_EPRESDIV_6                   (0x040U << FLEXCAN_CBT_EPRESDIV_Pos) 
#define  FLEXCAN_CBT_EPRESDIV_7                   (0x080U << FLEXCAN_CBT_EPRESDIV_Pos) 
#define  FLEXCAN_CBT_EPRESDIV_8                   (0x100U << FLEXCAN_CBT_EPRESDIV_Pos) 
#define  FLEXCAN_CBT_EPRESDIV_9                   (0x200U << FLEXCAN_CBT_EPRESDIV_Pos) 
#define  FLEXCAN_CBT_BTF_Pos                      (31)
#define  FLEXCAN_CBT_BTF_Msk                      (0x1U << FLEXCAN_CBT_BTF_Pos)                     /*!<Bit Timing Format ！ Enables the use of extended CAN bit timing fields EPRESDIV, EPROPSEG, EPSEG1, EPSEG2 and ERJW, replacing the CAN bit timing variables defined in CAN_CTRL1*/
#define  FLEXCAN_CBT_BTF                          FLEXCAN_CBT_BTF_Msk

/**
  * @brief FLEXCAN_RXIMR Register Bit Definition
  */
#define  FLEXCAN_RXIMR_MI_Pos                     (0)
#define  FLEXCAN_RXIMR_MI_Msk                     (0xFFFFFFFFU << FLEXCAN_RXIMR_MI_Pos)             /*!<Individual Mask Bits*/
#define  FLEXCAN_RXIMR_MI                         FLEXCAN_RXIMR_MI_Msk
#define  FLEXCAN_RXIMR_MI_0                       (0x00000001U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_1                       (0x00000002U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_2                       (0x00000004U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_3                       (0x00000008U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_4                       (0x00000010U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_5                       (0x00000020U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_6                       (0x00000040U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_7                       (0x00000080U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_8                       (0x00000100U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_9                       (0x00000200U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_10                      (0x00000400U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_11                      (0x00000800U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_12                      (0x00001000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_13                      (0x00002000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_14                      (0x00004000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_15                      (0x00008000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_16                      (0x00010000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_17                      (0x00020000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_18                      (0x00040000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_19                      (0x00080000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_20                      (0x00100000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_21                      (0x00200000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_22                      (0x00400000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_23                      (0x00800000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_24                      (0x01000000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_25                      (0x02000000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_26                      (0x04000000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_27                      (0x08000000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_28                      (0x10000000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_29                      (0x20000000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_30                      (0x40000000U << FLEXCAN_RXIMR_MI_Pos) 
#define  FLEXCAN_RXIMR_MI_31                      (0x80000000U << FLEXCAN_RXIMR_MI_Pos) 

/**
  * @brief FLEXCAN_FDCTRL Register Bit Definition
  */
#define  FLEXCAN_FDCTRL_TDCVAL_Pos                (0)
#define  FLEXCAN_FDCTRL_TDCVAL_Msk                (0x3FU << FLEXCAN_FDCTRL_TDCVAL_Pos)              /*!<Transceiver Delay Compensation Value - the value of the transceiver loop delay measured from the transmitted EDL to R0 transition edge to the respective received one added to the TDCOFF value*/
#define  FLEXCAN_FDCTRL_TDCVAL                    FLEXCAN_FDCTRL_TDCVAL_Msk
#define  FLEXCAN_FDCTRL_TDCVAL_0                  (0x01U << FLEXCAN_FDCTRL_TDCVAL_Pos) 
#define  FLEXCAN_FDCTRL_TDCVAL_1                  (0x02U << FLEXCAN_FDCTRL_TDCVAL_Pos) 
#define  FLEXCAN_FDCTRL_TDCVAL_2                  (0x04U << FLEXCAN_FDCTRL_TDCVAL_Pos) 
#define  FLEXCAN_FDCTRL_TDCVAL_3                  (0x08U << FLEXCAN_FDCTRL_TDCVAL_Pos) 
#define  FLEXCAN_FDCTRL_TDCVAL_4                  (0x10U << FLEXCAN_FDCTRL_TDCVAL_Pos) 
#define  FLEXCAN_FDCTRL_TDCVAL_5                  (0x20U << FLEXCAN_FDCTRL_TDCVAL_Pos) 
#define  FLEXCAN_FDCTRL_TDCOFF_Pos                (8)
#define  FLEXCAN_FDCTRL_TDCOFF_Msk                (0x1FU << FLEXCAN_FDCTRL_TDCOFF_Pos)              /*!<Transceiver Delay Compensation Offset - The offset is added to the measured transceiver loop delay to define the position of the delayed comparison point when bit rate switching is active.*/
#define  FLEXCAN_FDCTRL_TDCOFF                    FLEXCAN_FDCTRL_TDCOFF_Msk
#define  FLEXCAN_FDCTRL_TDCOFF_0                  (0x01U << FLEXCAN_FDCTRL_TDCOFF_Pos) 
#define  FLEXCAN_FDCTRL_TDCOFF_1                  (0x02U << FLEXCAN_FDCTRL_TDCOFF_Pos) 
#define  FLEXCAN_FDCTRL_TDCOFF_2                  (0x04U << FLEXCAN_FDCTRL_TDCOFF_Pos) 
#define  FLEXCAN_FDCTRL_TDCOFF_3                  (0x08U << FLEXCAN_FDCTRL_TDCOFF_Pos) 
#define  FLEXCAN_FDCTRL_TDCOFF_4                  (0x10U << FLEXCAN_FDCTRL_TDCOFF_Pos) 
#define  FLEXCAN_FDCTRL_TDCFAIL_Pos               (14)
#define  FLEXCAN_FDCTRL_TDCFAIL_Msk               (0x1U << FLEXCAN_FDCTRL_TDCFAIL_Pos)              /*!<Transceiver Delay Compensation Fail - The TDC mechanism is out of range, unable to compensate the transceiver¨s loop delay and successfully compare the delayed received bits to the transmitted ones*/
#define  FLEXCAN_FDCTRL_TDCFAIL                   FLEXCAN_FDCTRL_TDCFAIL_Msk
#define  FLEXCAN_FDCTRL_TDCEN_Pos                 (15)
#define  FLEXCAN_FDCTRL_TDCEN_Msk                 (0x1U << FLEXCAN_FDCTRL_TDCEN_Pos)                /*!<1: Transceiver Delay Compensation (TDC) enable*/
#define  FLEXCAN_FDCTRL_TDCEN                     FLEXCAN_FDCTRL_TDCEN_Msk
#define  FLEXCAN_FDCTRL_MBDSR0_Pos                (16)
#define  FLEXCAN_FDCTRL_MBDSR0_Msk                (0x3U << FLEXCAN_FDCTRL_MBDSR0_Pos)               /*!<Configuration data size*/
#define  FLEXCAN_FDCTRL_MBDSR0                    FLEXCAN_FDCTRL_MBDSR0_Msk
#define  FLEXCAN_FDCTRL_MBDSR0_0                  (0x1U << FLEXCAN_FDCTRL_MBDSR0_Pos) 
#define  FLEXCAN_FDCTRL_MBDSR0_1                  (0x2U << FLEXCAN_FDCTRL_MBDSR0_Pos) 
#define  FLEXCAN_FDCTRL_FDRATE_Pos                (31)
#define  FLEXCAN_FDCTRL_FDRATE_Msk                (0x1U << FLEXCAN_FDCTRL_FDRATE_Pos)               /*!<Bit rate switch enable*/
#define  FLEXCAN_FDCTRL_FDRATE                    FLEXCAN_FDCTRL_FDRATE_Msk

/**
  * @brief FLEXCAN_FDCBT Register Bit Definition
  */
#define  FLEXCAN_FDCBT_FPSEG2_Pos                 (0)
#define  FLEXCAN_FDCBT_FPSEG2_Msk                 (0x7U << FLEXCAN_FDCBT_FPSEG2_Pos)                /*!<Fast Phase Segment 2*/
#define  FLEXCAN_FDCBT_FPSEG2                     FLEXCAN_FDCBT_FPSEG2_Msk
#define  FLEXCAN_FDCBT_FPSEG2_0                   (0x1U << FLEXCAN_FDCBT_FPSEG2_Pos) 
#define  FLEXCAN_FDCBT_FPSEG2_1                   (0x2U << FLEXCAN_FDCBT_FPSEG2_Pos) 
#define  FLEXCAN_FDCBT_FPSEG2_2                   (0x4U << FLEXCAN_FDCBT_FPSEG2_Pos) 
#define  FLEXCAN_FDCBT_FPSEG1_Pos                 (5)
#define  FLEXCAN_FDCBT_FPSEG1_Msk                 (0x7U << FLEXCAN_FDCBT_FPSEG1_Pos)                /*!<Fast Phase Segment 1*/
#define  FLEXCAN_FDCBT_FPSEG1                     FLEXCAN_FDCBT_FPSEG1_Msk
#define  FLEXCAN_FDCBT_FPSEG1_0                   (0x1U << FLEXCAN_FDCBT_FPSEG1_Pos) 
#define  FLEXCAN_FDCBT_FPSEG1_1                   (0x2U << FLEXCAN_FDCBT_FPSEG1_Pos) 
#define  FLEXCAN_FDCBT_FPSEG1_2                   (0x4U << FLEXCAN_FDCBT_FPSEG1_Pos) 
#define  FLEXCAN_FDCBT_FPROPSEG_Pos               (10)
#define  FLEXCAN_FDCBT_FPROPSEG_Msk               (0x1FU << FLEXCAN_FDCBT_FPROPSEG_Pos)             /*!<Fast Propagation Segment*/
#define  FLEXCAN_FDCBT_FPROPSEG                   FLEXCAN_FDCBT_FPROPSEG_Msk
#define  FLEXCAN_FDCBT_FPROPSEG_0                 (0x01U << FLEXCAN_FDCBT_FPROPSEG_Pos) 
#define  FLEXCAN_FDCBT_FPROPSEG_1                 (0x02U << FLEXCAN_FDCBT_FPROPSEG_Pos) 
#define  FLEXCAN_FDCBT_FPROPSEG_2                 (0x04U << FLEXCAN_FDCBT_FPROPSEG_Pos) 
#define  FLEXCAN_FDCBT_FPROPSEG_3                 (0x08U << FLEXCAN_FDCBT_FPROPSEG_Pos) 
#define  FLEXCAN_FDCBT_FPROPSEG_4                 (0x10U << FLEXCAN_FDCBT_FPROPSEG_Pos) 
#define  FLEXCAN_FDCBT_FRJW_Pos                   (16)
#define  FLEXCAN_FDCBT_FRJW_Msk                   (0x7U << FLEXCAN_FDCBT_FRJW_Pos)                  /*!<Fast Resynchronization Jump Width*/
#define  FLEXCAN_FDCBT_FRJW                       FLEXCAN_FDCBT_FRJW_Msk
#define  FLEXCAN_FDCBT_FRJW_0                     (0x1U << FLEXCAN_FDCBT_FRJW_Pos) 
#define  FLEXCAN_FDCBT_FRJW_1                     (0x2U << FLEXCAN_FDCBT_FRJW_Pos) 
#define  FLEXCAN_FDCBT_FRJW_2                     (0x4U << FLEXCAN_FDCBT_FRJW_Pos) 
#define  FLEXCAN_FDCBT_FPRESDIV_Pos               (20)
#define  FLEXCAN_FDCBT_FPRESDIV_Msk               (0x3FFU << FLEXCAN_FDCBT_FPRESDIV_Pos)            /*!<Fast Prescaler Dividing Factor*/
#define  FLEXCAN_FDCBT_FPRESDIV                   FLEXCAN_FDCBT_FPRESDIV_Msk
#define  FLEXCAN_FDCBT_FPRESDIV_0                 (0x001U << FLEXCAN_FDCBT_FPRESDIV_Pos) 
#define  FLEXCAN_FDCBT_FPRESDIV_1                 (0x002U << FLEXCAN_FDCBT_FPRESDIV_Pos) 
#define  FLEXCAN_FDCBT_FPRESDIV_2                 (0x004U << FLEXCAN_FDCBT_FPRESDIV_Pos) 
#define  FLEXCAN_FDCBT_FPRESDIV_3                 (0x008U << FLEXCAN_FDCBT_FPRESDIV_Pos) 
#define  FLEXCAN_FDCBT_FPRESDIV_4                 (0x010U << FLEXCAN_FDCBT_FPRESDIV_Pos) 
#define  FLEXCAN_FDCBT_FPRESDIV_5                 (0x020U << FLEXCAN_FDCBT_FPRESDIV_Pos) 
#define  FLEXCAN_FDCBT_FPRESDIV_6                 (0x040U << FLEXCAN_FDCBT_FPRESDIV_Pos) 
#define  FLEXCAN_FDCBT_FPRESDIV_7                 (0x080U << FLEXCAN_FDCBT_FPRESDIV_Pos) 
#define  FLEXCAN_FDCBT_FPRESDIV_8                 (0x100U << FLEXCAN_FDCBT_FPRESDIV_Pos) 
#define  FLEXCAN_FDCBT_FPRESDIV_9                 (0x200U << FLEXCAN_FDCBT_FPRESDIV_Pos) 

/**
  * @brief FLEXCAN_FDCRC Register Bit Definition
  */
#define  FLEXCAN_FDCRC_FDTXCRC_Pos                (0)
#define  FLEXCAN_FDCRC_FDTXCRC_Msk                (0x1FFFFFU << FLEXCAN_FDCRC_FDTXCRC_Pos)          /*!<Extended transmission CRC value - indicates the CRC value calculated over the most recent transmitted message*/
#define  FLEXCAN_FDCRC_FDTXCRC                    FLEXCAN_FDCRC_FDTXCRC_Msk
#define  FLEXCAN_FDCRC_FDTXCRC_0                  (0x000001U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_1                  (0x000002U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_2                  (0x000004U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_3                  (0x000008U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_4                  (0x000010U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_5                  (0x000020U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_6                  (0x000040U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_7                  (0x000080U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_8                  (0x000100U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_9                  (0x000200U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_10                 (0x000400U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_11                 (0x000800U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_12                 (0x001000U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_13                 (0x002000U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_14                 (0x004000U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_15                 (0x008000U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_16                 (0x010000U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_17                 (0x020000U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_18                 (0x040000U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_19                 (0x080000U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDTXCRC_20                 (0x100000U << FLEXCAN_FDCRC_FDTXCRC_Pos) 
#define  FLEXCAN_FDCRC_FDMBCRC_Pos                (24)
#define  FLEXCAN_FDCRC_FDMBCRC_Msk                (0x7FU << FLEXCAN_FDCRC_FDMBCRC_Pos)              /*!<CRC Mailbox - indicates the number of the mailbox corresponding to the value in the FDTXCRC field, for both FD and non-FD frames*/
#define  FLEXCAN_FDCRC_FDMBCRC                    FLEXCAN_FDCRC_FDMBCRC_Msk
#define  FLEXCAN_FDCRC_FDMBCRC_0                  (0x01U << FLEXCAN_FDCRC_FDMBCRC_Pos) 
#define  FLEXCAN_FDCRC_FDMBCRC_1                  (0x02U << FLEXCAN_FDCRC_FDMBCRC_Pos) 
#define  FLEXCAN_FDCRC_FDMBCRC_2                  (0x04U << FLEXCAN_FDCRC_FDMBCRC_Pos) 
#define  FLEXCAN_FDCRC_FDMBCRC_3                  (0x08U << FLEXCAN_FDCRC_FDMBCRC_Pos) 
#define  FLEXCAN_FDCRC_FDMBCRC_4                  (0x10U << FLEXCAN_FDCRC_FDMBCRC_Pos) 
#define  FLEXCAN_FDCRC_FDMBCRC_5                  (0x20U << FLEXCAN_FDCRC_FDMBCRC_Pos) 
#define  FLEXCAN_FDCRC_FDMBCRC_6                  (0x40U << FLEXCAN_FDCRC_FDMBCRC_Pos) 

/**
  * @brief FLEXCAN_ERFCR Register Bit Definition
  */
#define  FLEXCAN_ERFCR_ERFWM_Pos                  (0)
#define  FLEXCAN_ERFCR_ERFWM_Msk                  (0x7U << FLEXCAN_ERFCR_ERFWM_Pos)                 /*!<Enhanced Rx FIFO Watermark - defines the minimum number of CAN messages stored in the Enhanced Rx FIFO*/
#define  FLEXCAN_ERFCR_ERFWM                      FLEXCAN_ERFCR_ERFWM_Msk
#define  FLEXCAN_ERFCR_ERFWM_0                    (0x1U << FLEXCAN_ERFCR_ERFWM_Pos) 
#define  FLEXCAN_ERFCR_ERFWM_1                    (0x2U << FLEXCAN_ERFCR_ERFWM_Pos) 
#define  FLEXCAN_ERFCR_ERFWM_2                    (0x4U << FLEXCAN_ERFCR_ERFWM_Pos) 
#define  FLEXCAN_ERFCR_NEXIF_Pos                  (16)
#define  FLEXCAN_ERFCR_NEXIF_Msk                  (0x1U << FLEXCAN_ERFCR_NEXIF_Pos)                 /*!<Number of Extended ID Filter Elements - defines the number of Extended ID Filtering Elements used during the Enhanced Rx FIFO matching process*/
#define  FLEXCAN_ERFCR_NEXIF                      FLEXCAN_ERFCR_NEXIF_Msk
#define  FLEXCAN_ERFCR_DMALW_Pos                  (26)
#define  FLEXCAN_ERFCR_DMALW_Msk                  (0x1FU << FLEXCAN_ERFCR_DMALW_Pos)                /*!<DMA Last Word - defines the last DMA address of each Enhanced Rx FIFO element. See ＾Table 1-32 DMALW and number of Enhanced Rx FIFO elements transferred￣.*/
#define  FLEXCAN_ERFCR_DMALW                      FLEXCAN_ERFCR_DMALW_Msk
#define  FLEXCAN_ERFCR_DMALW_0                    (0x01U << FLEXCAN_ERFCR_DMALW_Pos) 
#define  FLEXCAN_ERFCR_DMALW_1                    (0x02U << FLEXCAN_ERFCR_DMALW_Pos) 
#define  FLEXCAN_ERFCR_DMALW_2                    (0x04U << FLEXCAN_ERFCR_DMALW_Pos) 
#define  FLEXCAN_ERFCR_DMALW_3                    (0x08U << FLEXCAN_ERFCR_DMALW_Pos) 
#define  FLEXCAN_ERFCR_DMALW_4                    (0x10U << FLEXCAN_ERFCR_DMALW_Pos) 
#define  FLEXCAN_ERFCR_ERFEN_Pos                  (31)
#define  FLEXCAN_ERFCR_ERFEN_Msk                  (0x1U << FLEXCAN_ERFCR_ERFEN_Pos)                 /*!<1: Enhanced Rx FIFO enable*/
#define  FLEXCAN_ERFCR_ERFEN                      FLEXCAN_ERFCR_ERFEN_Msk

/**
  * @brief FLEXCAN_ERFIER Register Bit Definition
  */
#define  FLEXCAN_ERFIER_ERFDAIE_Pos               (28)
#define  FLEXCAN_ERFIER_ERFDAIE_Msk               (0x1U << FLEXCAN_ERFIER_ERFDAIE_Pos)              /*!<1: Enhanced Rx FIFO data available interrupt (ERFSR.ERFDA) enable*/
#define  FLEXCAN_ERFIER_ERFDAIE                   FLEXCAN_ERFIER_ERFDAIE_Msk
#define  FLEXCAN_ERFIER_ERFWMIIE_Pos              (29)
#define  FLEXCAN_ERFIER_ERFWMIIE_Msk              (0x1U << FLEXCAN_ERFIER_ERFWMIIE_Pos)             /*!<1: Enhanced Rx FIFO watermark interrupt (ERFSR.ERFWM) enable*/
#define  FLEXCAN_ERFIER_ERFWMIIE                  FLEXCAN_ERFIER_ERFWMIIE_Msk
#define  FLEXCAN_ERFIER_ERFOVFIE_Pos              (30)
#define  FLEXCAN_ERFIER_ERFOVFIE_Msk              (0x1U << FLEXCAN_ERFIER_ERFOVFIE_Pos)             /*!<1: Enhanced Rx FIFO overflow interrupt (ERFSR.ERFOVF) enable*/
#define  FLEXCAN_ERFIER_ERFOVFIE                  FLEXCAN_ERFIER_ERFOVFIE_Msk
#define  FLEXCAN_ERFIER_ERFUFWIE_Pos              (31)
#define  FLEXCAN_ERFIER_ERFUFWIE_Msk              (0x1U << FLEXCAN_ERFIER_ERFUFWIE_Pos)             /*!<1: Enhanced Rx FIFO underflow interrupt (ERFSR.ERFUFW) enable*/
#define  FLEXCAN_ERFIER_ERFUFWIE                  FLEXCAN_ERFIER_ERFUFWIE_Msk

/**
  * @brief FLEXCAN_ERFSR Register Bit Definition
  */
#define  FLEXCAN_ERFSR_ERFEL_Pos                  (0)
#define  FLEXCAN_ERFSR_ERFEL_Msk                  (0x7U << FLEXCAN_ERFSR_ERFEL_Pos)                 /*!<Indicate the number of CAN messages stored in the Enhanced Rx FIFO*/
#define  FLEXCAN_ERFSR_ERFEL                      FLEXCAN_ERFSR_ERFEL_Msk
#define  FLEXCAN_ERFSR_ERFEL_0                    (0x1U << FLEXCAN_ERFSR_ERFEL_Pos) 
#define  FLEXCAN_ERFSR_ERFEL_1                    (0x2U << FLEXCAN_ERFSR_ERFEL_Pos) 
#define  FLEXCAN_ERFSR_ERFEL_2                    (0x4U << FLEXCAN_ERFSR_ERFEL_Pos) 
#define  FLEXCAN_ERFSR_ERFF_Pos                   (16)
#define  FLEXCAN_ERFSR_ERFF_Msk                   (0x1U << FLEXCAN_ERFSR_ERFF_Pos)                  /*!<1: Enhanced Rx FIFO is full*/
#define  FLEXCAN_ERFSR_ERFF                       FLEXCAN_ERFSR_ERFF_Msk
#define  FLEXCAN_ERFSR_ERFE_Pos                   (17)
#define  FLEXCAN_ERFSR_ERFE_Msk                   (0x1U << FLEXCAN_ERFSR_ERFE_Pos)                  /*!<1: Enhanced Rx FIFO is empty*/
#define  FLEXCAN_ERFSR_ERFE                       FLEXCAN_ERFSR_ERFE_Msk
#define  FLEXCAN_ERFSR_ERFCLR_Pos                 (27)
#define  FLEXCAN_ERFSR_ERFCLR_Msk                 (0x1U << FLEXCAN_ERFSR_ERFCLR_Pos)                /*!<Enhanced Rx FIFO Clear*/
#define  FLEXCAN_ERFSR_ERFCLR                     FLEXCAN_ERFSR_ERFCLR_Msk
#define  FLEXCAN_ERFSR_ERFDA_Pos                  (28)
#define  FLEXCAN_ERFSR_ERFDA_Msk                  (0x1U << FLEXCAN_ERFSR_ERFDA_Pos)                 /*!<1: At least one message is stored in the Enhanced Rx FIFO. When CAN_ERFIER.ERFDAIE = 1, the corresponding interrupt is generated*/
#define  FLEXCAN_ERFSR_ERFDA                      FLEXCAN_ERFSR_ERFDA_Msk
#define  FLEXCAN_ERFSR_ERFWMI_Pos                 (29)
#define  FLEXCAN_ERFSR_ERFWMI_Msk                 (0x1U << FLEXCAN_ERFSR_ERFWMI_Pos)                /*!<1: The number of messages in the Enhanced Rx FIFO is greater than the setting value of CAN_ERFCR.ERFWM; when CAN_ERFIER.ERFWMIIE = 1, the corresponding interrupt is generated*/
#define  FLEXCAN_ERFSR_ERFWMI                     FLEXCAN_ERFSR_ERFWMI_Msk
#define  FLEXCAN_ERFSR_ERFOVF_Pos                 (30)
#define  FLEXCAN_ERFSR_ERFOVF_Msk                 (0x1U << FLEXCAN_ERFSR_ERFOVF_Pos)                /*!<1: Enhanced Rx FIFO overflow. When CAN_ERFIER. ERFOVFIE = 1, corresponding interrupt is generated*/
#define  FLEXCAN_ERFSR_ERFOVF                     FLEXCAN_ERFSR_ERFOVF_Msk
#define  FLEXCAN_ERFSR_ERFUFW_Pos                 (31)
#define  FLEXCAN_ERFSR_ERFUFW_Msk                 (0x1U << FLEXCAN_ERFSR_ERFUFW_Pos)                /*!<1: Enhanced Rx FIFO underflow. When CAN_ERFIER. ERFUFWIE = 1, corresponding interrupt is generated*/
#define  FLEXCAN_ERFSR_ERFUFW                     FLEXCAN_ERFSR_ERFUFW_Msk

