Maihuanyi/rt-thread/bsp/mm32f526x/Libraries/MM32F526x/Include/reg_flexcan.h
/**
  * @brief FLEXCAN_ERFFEL Register Bit Definition
  */
#define  FLEXCAN_ERFFEL_FEL_Pos                   (0)
#define  FLEXCAN_ERFFEL_FEL_Msk                   (0xFFFFFFFFU << FLEXCAN_ERFFEL_FEL_Pos)           /*!<Each filter element is used during the match process and, if the matching criteria are met, a message is stored in the Enhanced Rx FIFO.*/
#define  FLEXCAN_ERFFEL_FEL                       FLEXCAN_ERFFEL_FEL_Msk
#define  FLEXCAN_ERFFEL_FEL_0                     (0x00000001U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_1                     (0x00000002U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_2                     (0x00000004U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_3                     (0x00000008U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_4                     (0x00000010U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_5                     (0x00000020U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_6                     (0x00000040U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_7                     (0x00000080U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_8                     (0x00000100U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_9                     (0x00000200U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_10                    (0x00000400U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_11                    (0x00000800U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_12                    (0x00001000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_13                    (0x00002000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_14                    (0x00004000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_15                    (0x00008000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_16                    (0x00010000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_17                    (0x00020000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_18                    (0x00040000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_19                    (0x00080000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_20                    (0x00100000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_21                    (0x00200000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_22                    (0x00400000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_23                    (0x00800000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_24                    (0x01000000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_25                    (0x02000000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_26                    (0x04000000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_27                    (0x08000000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_28                    (0x10000000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_29                    (0x20000000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_30                    (0x40000000U << FLEXCAN_ERFFEL_FEL_Pos) 
#define  FLEXCAN_ERFFEL_FEL_31                    (0x80000000U << FLEXCAN_ERFFEL_FEL_Pos) 

/**
  * @brief FLEXCAN_CS Register Bit Definition
  */
#define  FLEXCAN_CS_TIME_STAMP_Pos                (0)
#define  FLEXCAN_CS_TIME_STAMP_Msk                (0xFFFFU << FLEXCAN_CS_TIME_STAMP_Pos)            /*!<*/
#define  FLEXCAN_CS_TIME_STAMP                    FLEXCAN_CS_TIME_STAMP_Msk
#define  FLEXCAN_CS_TIME_STAMP_0                  (0x0001U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_TIME_STAMP_1                  (0x0002U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_TIME_STAMP_2                  (0x0004U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_TIME_STAMP_3                  (0x0008U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_TIME_STAMP_4                  (0x0010U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_TIME_STAMP_5                  (0x0020U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_TIME_STAMP_6                  (0x0040U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_TIME_STAMP_7                  (0x0080U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_TIME_STAMP_8                  (0x0100U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_TIME_STAMP_9                  (0x0200U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_TIME_STAMP_10                 (0x0400U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_TIME_STAMP_11                 (0x0800U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_TIME_STAMP_12                 (0x1000U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_TIME_STAMP_13                 (0x2000U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_TIME_STAMP_14                 (0x4000U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_TIME_STAMP_15                 (0x8000U << FLEXCAN_CS_TIME_STAMP_Pos) 
#define  FLEXCAN_CS_DLC_Pos                       (16)
#define  FLEXCAN_CS_DLC_Msk                       (0xFU << FLEXCAN_CS_DLC_Pos)                      /*!<*/
#define  FLEXCAN_CS_DLC                           FLEXCAN_CS_DLC_Msk
#define  FLEXCAN_CS_DLC_0                         (0x1U << FLEXCAN_CS_DLC_Pos) 
#define  FLEXCAN_CS_DLC_1                         (0x2U << FLEXCAN_CS_DLC_Pos) 
#define  FLEXCAN_CS_DLC_2                         (0x4U << FLEXCAN_CS_DLC_Pos) 
#define  FLEXCAN_CS_DLC_3                         (0x8U << FLEXCAN_CS_DLC_Pos) 
#define  FLEXCAN_CS_RTR_Pos                       (20)
#define  FLEXCAN_CS_RTR_Msk                       (0x1U << FLEXCAN_CS_RTR_Pos)                      /*!<*/
#define  FLEXCAN_CS_RTR                           FLEXCAN_CS_RTR_Msk
#define  FLEXCAN_CS_IDE_Pos                       (21)
#define  FLEXCAN_CS_IDE_Msk                       (0x1U << FLEXCAN_CS_IDE_Pos)                      /*!<*/
#define  FLEXCAN_CS_IDE                           FLEXCAN_CS_IDE_Msk
#define  FLEXCAN_CS_SRR_Pos                       (22)
#define  FLEXCAN_CS_SRR_Msk                       (0x1U << FLEXCAN_CS_SRR_Pos)                      /*!<*/
#define  FLEXCAN_CS_SRR                           FLEXCAN_CS_SRR_Msk
#define  FLEXCAN_CS_CODE_Pos                      (24)
#define  FLEXCAN_CS_CODE_Msk                      (0xFU << FLEXCAN_CS_CODE_Pos)                     /*!<*/
#define  FLEXCAN_CS_CODE                          FLEXCAN_CS_CODE_Msk
#define  FLEXCAN_CS_CODE_0                        (0x1U << FLEXCAN_CS_CODE_Pos) 
#define  FLEXCAN_CS_CODE_1                        (0x2U << FLEXCAN_CS_CODE_Pos) 
#define  FLEXCAN_CS_CODE_2                        (0x4U << FLEXCAN_CS_CODE_Pos) 
#define  FLEXCAN_CS_CODE_3                        (0x8U << FLEXCAN_CS_CODE_Pos) 
#define  FLEXCAN_CS_ESI_Pos                       (29)
#define  FLEXCAN_CS_ESI_Msk                       (0x1U << FLEXCAN_CS_ESI_Pos)                      /*!<*/
#define  FLEXCAN_CS_ESI                           FLEXCAN_CS_ESI_Msk
#define  FLEXCAN_CS_BRS_Pos                       (30)
#define  FLEXCAN_CS_BRS_Msk                       (0x1U << FLEXCAN_CS_BRS_Pos)                      /*!<*/
#define  FLEXCAN_CS_BRS                           FLEXCAN_CS_BRS_Msk
#define  FLEXCAN_CS_EDL_Pos                       (31)
#define  FLEXCAN_CS_EDL_Msk                       (0x1U << FLEXCAN_CS_EDL_Pos)                      /*!<*/
#define  FLEXCAN_CS_EDL                           FLEXCAN_CS_EDL_Msk

/**
  * @brief FLEXCAN_ID Register Bit Definition
  */
#define  FLEXCAN_ID_EXT_Pos                       (0)
#define  FLEXCAN_ID_EXT_Msk                       (0x3FFFFU << FLEXCAN_ID_EXT_Pos)                  /*!<*/
//#define  FLEXCAN_ID_EXT                           FLEXCAN_ID_EXT_Msk
#define  FLEXCAN_ID_EXT_0                         (0x00001U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_1                         (0x00002U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_2                         (0x00004U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_3                         (0x00008U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_4                         (0x00010U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_5                         (0x00020U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_6                         (0x00040U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_7                         (0x00080U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_8                         (0x00100U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_9                         (0x00200U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_10                        (0x00400U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_11                        (0x00800U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_12                        (0x01000U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_13                        (0x02000U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_14                        (0x04000U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_15                        (0x08000U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_16                        (0x10000U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_EXT_17                        (0x20000U << FLEXCAN_ID_EXT_Pos) 
#define  FLEXCAN_ID_STD_Pos                       (18)
#define  FLEXCAN_ID_STD_Msk                       (0x7FFU << FLEXCAN_ID_STD_Pos)                    /*!<*/
//#define  FLEXCAN_ID_STD                           FLEXCAN_ID_STD_Msk
#define  FLEXCAN_ID_STD_0                         (0x001U << FLEXCAN_ID_STD_Pos) 
#define  FLEXCAN_ID_STD_1                         (0x002U << FLEXCAN_ID_STD_Pos) 
#define  FLEXCAN_ID_STD_2                         (0x004U << FLEXCAN_ID_STD_Pos) 
#define  FLEXCAN_ID_STD_3                         (0x008U << FLEXCAN_ID_STD_Pos) 
#define  FLEXCAN_ID_STD_4                         (0x010U << FLEXCAN_ID_STD_Pos) 
#define  FLEXCAN_ID_STD_5                         (0x020U << FLEXCAN_ID_STD_Pos) 
#define  FLEXCAN_ID_STD_6                         (0x040U << FLEXCAN_ID_STD_Pos) 
#define  FLEXCAN_ID_STD_7                         (0x080U << FLEXCAN_ID_STD_Pos) 
#define  FLEXCAN_ID_STD_8                         (0x100U << FLEXCAN_ID_STD_Pos) 
#define  FLEXCAN_ID_STD_9                         (0x200U << FLEXCAN_ID_STD_Pos) 
#define  FLEXCAN_ID_STD_10                        (0x400U << FLEXCAN_ID_STD_Pos) 
#define  FLEXCAN_ID_PRIO_Pos                      (29)
#define  FLEXCAN_ID_PRIO_Msk                      (0x7U << FLEXCAN_ID_PRIO_Pos)                     /*!<*/
#define  FLEXCAN_ID_PRIO                          FLEXCAN_ID_PRIO_Msk
#define  FLEXCAN_ID_PRIO_0                        (0x1U << FLEXCAN_ID_PRIO_Pos) 
#define  FLEXCAN_ID_PRIO_1                        (0x2U << FLEXCAN_ID_PRIO_Pos) 
#define  FLEXCAN_ID_PRIO_2                        (0x4U << FLEXCAN_ID_PRIO_Pos) 

/**
  * @brief FLEXCAN_WORD0 Register Bit Definition
  */
#define  FLEXCAN_WORD0_DATA_Byte0_Pos             (0)
#define  FLEXCAN_WORD0_DATA_Byte0_Msk             (0xFFU << FLEXCAN_WORD0_DATA_Byte0_Pos)           /*!<*/
#define  FLEXCAN_WORD0_DATA_Byte0                 FLEXCAN_WORD0_DATA_Byte0_Msk
#define  FLEXCAN_WORD0_DATA_Byte0_0               (0x01U << FLEXCAN_WORD0_DATA_Byte0_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte0_1               (0x02U << FLEXCAN_WORD0_DATA_Byte0_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte0_2               (0x04U << FLEXCAN_WORD0_DATA_Byte0_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte0_3               (0x08U << FLEXCAN_WORD0_DATA_Byte0_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte0_4               (0x10U << FLEXCAN_WORD0_DATA_Byte0_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte0_5               (0x20U << FLEXCAN_WORD0_DATA_Byte0_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte0_6               (0x40U << FLEXCAN_WORD0_DATA_Byte0_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte0_7               (0x80U << FLEXCAN_WORD0_DATA_Byte0_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte1_Pos             (1)
#define  FLEXCAN_WORD0_DATA_Byte1_Msk             (0xFFU << FLEXCAN_WORD0_DATA_Byte1_Pos)           /*!<*/
#define  FLEXCAN_WORD0_DATA_Byte1                 FLEXCAN_WORD0_DATA_Byte1_Msk
#define  FLEXCAN_WORD0_DATA_Byte1_0               (0x01U << FLEXCAN_WORD0_DATA_Byte1_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte1_1               (0x02U << FLEXCAN_WORD0_DATA_Byte1_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte1_2               (0x04U << FLEXCAN_WORD0_DATA_Byte1_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte1_3               (0x08U << FLEXCAN_WORD0_DATA_Byte1_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte1_4               (0x10U << FLEXCAN_WORD0_DATA_Byte1_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte1_5               (0x20U << FLEXCAN_WORD0_DATA_Byte1_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte1_6               (0x40U << FLEXCAN_WORD0_DATA_Byte1_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte1_7               (0x80U << FLEXCAN_WORD0_DATA_Byte1_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte2_Pos             (2)
#define  FLEXCAN_WORD0_DATA_Byte2_Msk             (0xFFU << FLEXCAN_WORD0_DATA_Byte2_Pos)           /*!<*/
#define  FLEXCAN_WORD0_DATA_Byte2                 FLEXCAN_WORD0_DATA_Byte2_Msk
#define  FLEXCAN_WORD0_DATA_Byte2_0               (0x01U << FLEXCAN_WORD0_DATA_Byte2_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte2_1               (0x02U << FLEXCAN_WORD0_DATA_Byte2_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte2_2               (0x04U << FLEXCAN_WORD0_DATA_Byte2_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte2_3               (0x08U << FLEXCAN_WORD0_DATA_Byte2_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte2_4               (0x10U << FLEXCAN_WORD0_DATA_Byte2_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte2_5               (0x20U << FLEXCAN_WORD0_DATA_Byte2_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte2_6               (0x40U << FLEXCAN_WORD0_DATA_Byte2_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte2_7               (0x80U << FLEXCAN_WORD0_DATA_Byte2_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte3_Pos             (3)
#define  FLEXCAN_WORD0_DATA_Byte3_Msk             (0xFFU << FLEXCAN_WORD0_DATA_Byte3_Pos)           /*!<*/
#define  FLEXCAN_WORD0_DATA_Byte3                 FLEXCAN_WORD0_DATA_Byte3_Msk
#define  FLEXCAN_WORD0_DATA_Byte3_0               (0x01U << FLEXCAN_WORD0_DATA_Byte3_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte3_1               (0x02U << FLEXCAN_WORD0_DATA_Byte3_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte3_2               (0x04U << FLEXCAN_WORD0_DATA_Byte3_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte3_3               (0x08U << FLEXCAN_WORD0_DATA_Byte3_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte3_4               (0x10U << FLEXCAN_WORD0_DATA_Byte3_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte3_5               (0x20U << FLEXCAN_WORD0_DATA_Byte3_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte3_6               (0x40U << FLEXCAN_WORD0_DATA_Byte3_Pos) 
#define  FLEXCAN_WORD0_DATA_Byte3_7               (0x80U << FLEXCAN_WORD0_DATA_Byte3_Pos) 

/**
  * @brief FLEXCAN_WORD1 Register Bit Definition
  */
#define  FLEXCAN_WORD1_DATA_Byte4_Pos             (0)
#define  FLEXCAN_WORD1_DATA_Byte4_Msk             (0xFFU << FLEXCAN_WORD1_DATA_Byte4_Pos)           /*!<*/
#define  FLEXCAN_WORD1_DATA_Byte4                 FLEXCAN_WORD1_DATA_Byte4_Msk
#define  FLEXCAN_WORD1_DATA_Byte4_0               (0x01U << FLEXCAN_WORD1_DATA_Byte4_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte4_1               (0x02U << FLEXCAN_WORD1_DATA_Byte4_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte4_2               (0x04U << FLEXCAN_WORD1_DATA_Byte4_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte4_3               (0x08U << FLEXCAN_WORD1_DATA_Byte4_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte4_4               (0x10U << FLEXCAN_WORD1_DATA_Byte4_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte4_5               (0x20U << FLEXCAN_WORD1_DATA_Byte4_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte4_6               (0x40U << FLEXCAN_WORD1_DATA_Byte4_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte4_7               (0x80U << FLEXCAN_WORD1_DATA_Byte4_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte5_Pos             (1)
#define  FLEXCAN_WORD1_DATA_Byte5_Msk             (0xFFU << FLEXCAN_WORD1_DATA_Byte5_Pos)           /*!<*/
#define  FLEXCAN_WORD1_DATA_Byte5                 FLEXCAN_WORD1_DATA_Byte5_Msk
#define  FLEXCAN_WORD1_DATA_Byte5_0               (0x01U << FLEXCAN_WORD1_DATA_Byte5_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte5_1               (0x02U << FLEXCAN_WORD1_DATA_Byte5_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte5_2               (0x04U << FLEXCAN_WORD1_DATA_Byte5_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte5_3               (0x08U << FLEXCAN_WORD1_DATA_Byte5_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte5_4               (0x10U << FLEXCAN_WORD1_DATA_Byte5_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte5_5               (0x20U << FLEXCAN_WORD1_DATA_Byte5_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte5_6               (0x40U << FLEXCAN_WORD1_DATA_Byte5_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte5_7               (0x80U << FLEXCAN_WORD1_DATA_Byte5_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte6_Pos             (2)
#define  FLEXCAN_WORD1_DATA_Byte6_Msk             (0xFFU << FLEXCAN_WORD1_DATA_Byte6_Pos)           /*!<*/
#define  FLEXCAN_WORD1_DATA_Byte6                 FLEXCAN_WORD1_DATA_Byte6_Msk
#define  FLEXCAN_WORD1_DATA_Byte6_0               (0x01U << FLEXCAN_WORD1_DATA_Byte6_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte6_1               (0x02U << FLEXCAN_WORD1_DATA_Byte6_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte6_2               (0x04U << FLEXCAN_WORD1_DATA_Byte6_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte6_3               (0x08U << FLEXCAN_WORD1_DATA_Byte6_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte6_4               (0x10U << FLEXCAN_WORD1_DATA_Byte6_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte6_5               (0x20U << FLEXCAN_WORD1_DATA_Byte6_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte6_6               (0x40U << FLEXCAN_WORD1_DATA_Byte6_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte6_7               (0x80U << FLEXCAN_WORD1_DATA_Byte6_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte7_Pos             (3)
#define  FLEXCAN_WORD1_DATA_Byte7_Msk             (0xFFU << FLEXCAN_WORD1_DATA_Byte7_Pos)           /*!<*/
#define  FLEXCAN_WORD1_DATA_Byte7                 FLEXCAN_WORD1_DATA_Byte7_Msk
#define  FLEXCAN_WORD1_DATA_Byte7_0               (0x01U << FLEXCAN_WORD1_DATA_Byte7_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte7_1               (0x02U << FLEXCAN_WORD1_DATA_Byte7_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte7_2               (0x04U << FLEXCAN_WORD1_DATA_Byte7_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte7_3               (0x08U << FLEXCAN_WORD1_DATA_Byte7_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte7_4               (0x10U << FLEXCAN_WORD1_DATA_Byte7_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte7_5               (0x20U << FLEXCAN_WORD1_DATA_Byte7_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte7_6               (0x40U << FLEXCAN_WORD1_DATA_Byte7_Pos) 
#define  FLEXCAN_WORD1_DATA_Byte7_7               (0x80U << FLEXCAN_WORD1_DATA_Byte7_Pos) 


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif

